src/ex_Tabakon/Reports/ТБКОтчетОстаткиВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ТБКОтчетОстаткиВРознице</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЗатяжек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловинеНаЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнакУсловиня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/ex_Tabakon/Reports/ТБКОтчетОстаткиВРознице/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(КоличествоЗатяжек) Тогда
		
		Этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос =
		СтрЗаменить(этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, 
		"И ТоварыНаСкладахОстатки.Номенклатура.Наименование ПОДОБНО &НаименованиеКоличествоЗатяжек", "");
		
	КонецЕсли;
	
	
	Настройки = КомпоновщикНастроек.Настройки;
	Наименование = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Наименование"));
	Наименование.Использование = Истина;
	Наименование.Значение = "%" + Номенклатура + "%";

	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НаименованиеКоличествоЗатяжек"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = "%" + КоличествоЗатяжек + "%";
	
	//Марк 2026-03-05 https://jira.tabkn.ru/browse/ROZ-23
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЕстьУсловинеНаЦену"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = ЕстьУсловинеНаЦену И ЗначениеЗаполнено(ЗнакУсловиня);
	
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Цена"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = Цена;  
	
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЗнакСравнения"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = ЗнакУсловиня;
	//КонецМарк
	
КонецПроцедуры
